namespace StoringPassword.Models
{
    // доменна модель користувача (user domain model)
    public class User
    {
        public int Id { get; set; }

        public string? FirstName { get; set; }

        public string? LastName { get; set; }

        public string? Login { get; set; }

        public string? Password { get; set; } // хеш пароля (ніколи не зберігається у відкритому вигляді)
        // сіль — це випадково згенерований рядок (зазвичай 16 байтів у hex-форматі),
        // який додається до пароля перед хешуванням; це захищає від rainbow-table атак (rainbow table атака, атака за допомогою райдужних таблиць — це метод злому паролів, який використовує попередньо обчислені таблиці для швидкого відновлення оригінального пароля з його хешу)
        // та обробляє однакові паролі різними хешами для різних користувачів.

        public string? Salt { get; set; } // унікальна сіль для кожного користувача
        // сіль зберігається у відкритому вигляді разом з хешем, бо потрібна для перевірки пароля;
        // вона не є секретом, але її випадковість та унікальність значно підвищують безпеку, бажано зберігати солі в окремій таблиці
    }
}